RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_gpio.h
/**
 **************************************************************************
 * File Name    : at32f4xx_gpio.h
 * Description  : at32f4xx GPIO header file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_GPIO_H
#define __AT32F4xx_GPIO_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup GPIO
  * @{
  */

/** @defgroup GPIO_Exported_Types
  * @{
  */

#if defined (AT32F413xx) || defined (AT32F415xx)
#define IS_GPIO_ALL_PERIPH(PERIPH) (((PERIPH) == GPIOA) || \
                                    ((PERIPH) == GPIOB) || \
                                    ((PERIPH) == GPIOC) || \
                                    ((PERIPH) == GPIOD) || \
                                    ((PERIPH) == GPIOF))
#elif defined AT32F403xx
#define IS_GPIO_ALL_PERIPH(PERIPH) (((PERIPH) == GPIOA) || \
                                    ((PERIPH) == GPIOB) || \
                                    ((PERIPH) == GPIOC) || \
                                    ((PERIPH) == GPIOD) || \
                                    ((PERIPH) == GPIOE) || \
                                    ((PERIPH) == GPIOF) || \
                                    ((PERIPH) == GPIOG))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_GPIO_ALL_PERIPH(PERIPH) (((PERIPH) == GPIOA) || \
                                    ((PERIPH) == GPIOB) || \
                                    ((PERIPH) == GPIOC) || \
                                    ((PERIPH) == GPIOD) || \
                                    ((PERIPH) == GPIOE))
#endif


/**
  * @brief  Output Maximum frequency selection
  */

typedef enum
{
  GPIO_MaxSpeed_10MHz = 1,
  GPIO_MaxSpeed_2MHz,
  GPIO_MaxSpeed_50MHz = 2
}GPIOMaxSpeed_Type;
#define IS_GPIO_MAXSPEED(MAXSPEED) (((MAXSPEED) == GPIO_MaxSpeed_10MHz) ||\
                                    ((MAXSPEED) == GPIO_MaxSpeed_2MHz)  || \
                                    ((MAXSPEED) == GPIO_MaxSpeed_50MHz))

/**
  * @brief  Configuration Mode enumeration
  */

typedef enum
{ GPIO_Mode_IN_ANALOG = 0x0,
  GPIO_Mode_IN_FLOATING = 0x04,
  GPIO_Mode_IN_PD = 0x28,
  GPIO_Mode_IN_PU = 0x48,
  GPIO_Mode_OUT_OD = 0x14,
  GPIO_Mode_OUT_PP = 0x10,
  GPIO_Mode_AF_OD = 0x1C,
  GPIO_Mode_AF_PP = 0x18
}GPIOMode_Type;

#define IS_GPIO_MDE(MDE) (((MDE) == GPIO_Mode_IN_ANALOG) || ((MDE) == GPIO_Mode_IN_FLOATING) || \
                          ((MDE) == GPIO_Mode_IN_PD)     || ((MDE) == GPIO_Mode_IN_PU)       || \
                          ((MDE) == GPIO_Mode_OUT_OD)    || ((MDE) == GPIO_Mode_OUT_PP)      || \
                          ((MDE) == GPIO_Mode_AF_OD)     || ((MDE) == GPIO_Mode_AF_PP))

/**
  * @brief  GPIO Init structure definition
  */

typedef struct
{
  uint16_t GPIO_Pins;               /*!< Specifies the GPIO pins to be configured.
                                      This parameter can be any value of @ref GPIO_pins_define */

  GPIOMaxSpeed_Type GPIO_MaxSpeed;  /*!< Specifies the speed for the selected pins.
                                      This parameter can be a value of @ref GPIOMaxSpeed_Type */

  GPIOMode_Type GPIO_Mode;          /*!< Specifies the operating mode for the selected pins.
                                      This parameter can be a value of @ref GPIOMode_Type */
}GPIO_InitType;


/**
  * @brief  Bit_SET and Bit_RESET enumeration
  */

typedef enum
{ Bit_RESET = 0,
  Bit_SET
}BitState;

#define IS_GPIO_BIT_STATE(STATE) (((STATE) == Bit_RESET) || ((STATE) == Bit_SET))

/**
  * @}
  */

/** @defgroup GPIO_Exported_Constants
  * @{
  */

/** @defgroup GPIO_pins_define
  * @{
  */

#define GPIO_Pins_0                 ((uint16_t)0x0001)  /*!< Pin 0 selected */
#define GPIO_Pins_1                 ((uint16_t)0x0002)  /*!< Pin 1 selected */
#define GPIO_Pins_2                 ((uint16_t)0x0004)  /*!< Pin 2 selected */
#define GPIO_Pins_3                 ((uint16_t)0x0008)  /*!< Pin 3 selected */
#define GPIO_Pins_4                 ((uint16_t)0x0010)  /*!< Pin 4 selected */
#define GPIO_Pins_5                 ((uint16_t)0x0020)  /*!< Pin 5 selected */
#define GPIO_Pins_6                 ((uint16_t)0x0040)  /*!< Pin 6 selected */
#define GPIO_Pins_7                 ((uint16_t)0x0080)  /*!< Pin 7 selected */
#define GPIO_Pins_8                 ((uint16_t)0x0100)  /*!< Pin 8 selected */
#define GPIO_Pins_9                 ((uint16_t)0x0200)  /*!< Pin 9 selected */
#define GPIO_Pins_10                ((uint16_t)0x0400)  /*!< Pin 10 selected */
#define GPIO_Pins_11                ((uint16_t)0x0800)  /*!< Pin 11 selected */
#define GPIO_Pins_12                ((uint16_t)0x1000)  /*!< Pin 12 selected */
#define GPIO_Pins_13                ((uint16_t)0x2000)  /*!< Pin 13 selected */
#define GPIO_Pins_14                ((uint16_t)0x4000)  /*!< Pin 14 selected */
#define GPIO_Pins_15                ((uint16_t)0x8000)  /*!< Pin 15 selected */
#define GPIO_Pins_All               ((uint16_t)0xFFFF)  /*!< All pins selected */

#define IS_GPIO_PINS(PINS) ((((PINS) & (uint16_t)0x00) == 0x00) && ((PINS) != (uint16_t)0x00))

#define IS_GET_GPIO_PINS(PINS)      (((PINS) == GPIO_Pins_0)  || \
                                     ((PINS) == GPIO_Pins_1)  || \
                                     ((PINS) == GPIO_Pins_2)  || \
                                     ((PINS) == GPIO_Pins_3)  || \
                                     ((PINS) == GPIO_Pins_4)  || \
                                     ((PINS) == GPIO_Pins_5)  || \
                                     ((PINS) == GPIO_Pins_6)  || \
                                     ((PINS) == GPIO_Pins_7)  || \
                                     ((PINS) == GPIO_Pins_8)  || \
                                     ((PINS) == GPIO_Pins_9)  || \
                                     ((PINS) == GPIO_Pins_10) || \
                                     ((PINS) == GPIO_Pins_11) || \
                                     ((PINS) == GPIO_Pins_12) || \
                                     ((PINS) == GPIO_Pins_13) || \
                                     ((PINS) == GPIO_Pins_14) || \
                                     ((PINS) == GPIO_Pins_15))

/**
  * @}
  */

#if defined (AT32F403xx) || defined (AT32F413xx)|| defined (AT32F415xx) || defined (AT32F403Axx) || defined (AT32F407xx)
/** @defgroup GPIO_Remap_define
  * @{
  */

/** @defgroup AFIO_MAP_define
  * @{
  */
#define GPIO_Remap01_SPI1           ((uint32_t)0x00000001)  /*!< SPI1 Alternate Function mapping 01 */
#define GPIO_Remap_I2C1             ((uint32_t)0x00000002)  /*!< I2C1 Alternate Function mapping */
#define GPIO_Remap_USART1           ((uint32_t)0x00000004)  /*!< USART1 Alternate Function mapping */
#define GPIO_PartialRemap_USART3    ((uint32_t)0x00000010)  /*!< USART3 Partial Alternate Function mapping */
#define GPIO_PartialRemap_TMR1      ((uint32_t)0x00000040)  /*!< TMR1 Partial Alternate Function mapping */
#define GPIO_PartialRemap1_TMR2     ((uint32_t)0x00000100)  /*!< TMR2 Partial1 Alternate Function mapping */
#define GPIO_PartialRemap2_TMR2     ((uint32_t)0x00000200)  /*!< TMR2 Partial2 Alternate Function mapping */
#define GPIO_FullRemap_TMR2         ((uint32_t)0x00000300)  /*!< TMR2 Full Alternate Function mapping */
#define GPIO_PartialRemap_TMR3      ((uint32_t)0x00000800)  /*!< TMR3 Partial Alternate Function mapping */
#define GPIO_FullRemap_TMR3         ((uint32_t)0x00000C00)  /*!< TMR3 Full Alternate Function mapping */
#define GPIO_Remap1_CAN1            ((uint32_t)0x00004000)  /*!< CAN1 Alternate Function mapping */
#define GPIO_Remap_PD01             ((uint32_t)0x00008000)  /*!< PD01 Alternate Function mapping */
#define GPIO_Remap_TMR5CH4_LSI      ((uint32_t)0x00010000)  /*!< LSI connected to TMR5 Channel4 input capture for calibration */
#define GPIO_Remap_ADC1_EXTRGINJ    ((uint32_t)0x00020000)  /*!< ADC1 External Trigger Injected Conversion remapping */
#define GPIO_Remap_ADC1_EXTRGREG    ((uint32_t)0x00040000)  /*!< ADC1 External Trigger Regular Conversion remapping */
#define GPIO_Remap_SWJ_NoJNTRST     ((uint32_t)0x01000000)  /*!< Full SWJ Enabled (JTAG-DP + SW-DP) but without JTRST */
#define GPIO_Remap_SWJ_JTAGDisable  ((uint32_t)0x02000000)  /*!< JTAG-DP Disabled and SW-DP Enabled */
#define GPIO_Remap_SWJ_AllDisable   ((uint32_t)0x04000000)  /*!< Full SWJ Disabled (JTAG-DP + SW-DP) */
#ifdef AT32F403xx
#define GPIO_Remap10_SPI1           ((uint32_t)0x80000000)  /*!< SPI1 Alternate Function mapping 10*/
#define GPIO_Remap_USART2           ((uint32_t)0x00000008)  /*!< USART2 Alternate Function mapping */
#define GPIO_FullRemap_USART3       ((uint32_t)0x00000030)  /*!< USART3 Full Alternate Function mapping */
#define GPIO_FullRemap_TMR1         ((uint32_t)0x000000C0)  /*!< TMR1 Full Alternate Function mapping */
#define GPIO_Remap_TMR4             ((uint32_t)0x00001000)  /*!< TMR4 Alternate Function mapping */
#define GPIO_Remap2_CAN1            ((uint32_t)0x00006000)  /*!< CAN1 Alternate Function mapping */
#define GPIO_Remap_ADC2_EXTRGINJ    ((uint32_t)0x00080000)  /*!< ADC2 External Trigger Injected Conversion remapping */
#define GPIO_Remap_ADC2_EXTRGREG    ((uint32_t)0x00100000)  /*!< ADC2 External Trigger Regular Conversion remapping */
#elif defined (AT32F413xx)
#define GPIO_Remap_ADC2_EXTRGINJ    ((uint32_t)0x00080000)  /*!< ADC2 External Trigger Injected Conversion remapping */
#define GPIO_Remap_ADC2_EXTRGREG    ((uint32_t)0x00100000)  /*!< ADC2 External Trigger Regular Conversion remapping */
#elif defined (AT32F415xx)
#define GPIO_PartialRemap2_USART3   ((uint32_t)0x00000020)  /*!< EXT_FLASH Alternate Function mapping*/
#define GPIO_PartialRemap2_TMR1     ((uint32_t)0x00000080)  /*!< TMR1 Partial2 Alternate Function mapping */
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define GPIO_Remap_USART2           ((uint32_t)0x00000008)  /*!< USART2 Alternate Function mapping */
#define GPIO_FullRemap_USART3       ((uint32_t)0x00000030)  /*!< USART3 Full Alternate Function mapping */
#define GPIO_FullRemap_TMR1         ((uint32_t)0x000000C0)  /*!< TMR1 Full Alternate Function mapping */
#define GPIO_Remap_TMR4             ((uint32_t)0x00001000)  /*!< TMR4 Alternate Function mapping */
#define GPIO_Remap2_CAN1            ((uint32_t)0x00006000)  /*!< CAN1 Alternate Function mapping */
#define GPIO_Remap_ADC2_EXTRGINJ    ((uint32_t)0x00080000)  /*!< ADC2 External Trigger Injected Conversion remapping */
#define GPIO_Remap_ADC2_EXTRGREG    ((uint32_t)0x00100000)  /*!< ADC2 External Trigger Regular Conversion remapping */
#define GPIO_Remap_ETH              ((uint32_t)0x00200000)  /*!< ETH Alternate Function mapping*/
#define GPIO_Remap_CAN2             ((uint32_t)0x00400000)  /*!< CAN2 Alternate Function mapping*/
#define GPIO_Remap_MII_RMII         ((uint32_t)0x00800000)  /*!< MII or RMII Alternate Function mapping */
#define GPIO_Remap_SPI3             ((uint32_t)0x10000000)  /*!< SPI3 Alternate Function mapping*/
#define GPIO_Remap_TMR2ITR1         ((uint32_t)0x20000000)  /*!< TMR2 internal trigger 1 Alternate remapping    */
#define GPIO_Remap_PTP_PPS          ((uint32_t)0x40000000)  /*!< Ethernet PTP PPS Alternate Function remapping  */
#endif
/**
  * @}
  */

